tests/concurrency-test.yaml
config:
  target: "http://localhost:8080"
  phases:
    # 1초간 동시 요청 n건
    - duration: 1
      arrivalCount: 7
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./processor.js"

scenarios:
  - name: "동시요청 POST with random message"
    flow:
      - function: "randomMessage"
      - post:
          url: "/test-kafka/batch"
          json:
            message: "{{ message }}"